Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །སྔོན་དབང་བའི་རྒྱལ་པོའི་བུ་གང་ཡིན་པ་དེས་བདག་གིས་སྔོན་རྒྱལ་པོའི་བུ་མོ་ཐོབ་པ་གང་ཡིན་པ་དེ་གཞོན་ནུ་ཀུ་ཤས་བོར་ཏེ་རང་གི་ཁྱིམ་དུ་སོང་ངོ་ཞེས་ཐོས་ནས་དེས་རྒྱལ་པོ་དེ་ལ་གལ་ཏེ་རེ་ཞིག་ཁོ་བོ་ལ་བུ་མོ་བྱིན་ན་ནི་དེ་ལྟ་ན་ལེགས།
en: “The prince who had once been the fiancé of the princess heard that the princess, whom he had once almost gained, had abandoned Prince Kuśa and gone home. He sent a message to the king (the father of the princess): ‘If you give me your daughter, that’s fine.

source: གལ་ཏེ་མ་བྱིན་ན་ནི་རྒྱལ་སྲིད་སྟོར་བར་བྱའོ་ཞེས་སྤྲིང་བ་དང་། དེས་སྨྲས་པ།
en: But if you do not, you will lose your kingdom.’

source: ཁོ་བོའི་བུ་མོ་འདི་ནི་རྒྱལ་པོ་ལ་ཉེ་ཅན་ཆེན་པོའི་བུ་གཞོན་ནུ་ཀུ་ཤ་ལ་བྱིན་ཟིན་པས་ཇི་ལྟར་གཞན་ལ་སྦྱིན།
en: “ ‘I have already given this daughter of mine to Prince Kuśa, a son of King Mahāśakuni,’ the king replied. ‘How could I give her to another man?’

source: དེ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་འོངས་ནས་རྒྱལ་པོའི་ཕོ་བྲང་བསྐོར་ཏེ་འདུག་གོ།
en: “That prince came with an army consisting of four divisions and surrounded the palace.

source: །རྒྱལ་པོ་དེ་ནི་དེ་དང་ལྷན་ཅིག་གཡུལ་སྤྲོད་མ་ཕོད་ནས་དེས་སྒོ་དག་བཅད་ནས་འདུག་པ་དང་། གཞོན་ནུ་ཀུ་ཤས་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: Unable to fight him, the king shut the gates and stood there.

source: ཤེས་ལྡན་དག་ཅིའི་ཕྱིར་སྒོ་རྣམས་བཅད། དེ་རྣམས་ཀྱིས་དེ་ལ་རྒྱས་པར་སྨྲས་པ་དང་། གཞོན་ནུ་ཀུ་ཤས་སྨྲས་པ། གལ་ཏེ་ཁོ་བོ་ལ་རྒྱལ་པོའི་སྲས་མོ་བྱིན་ན་ཁོ་བོས་དེ་དང་ལྷན་ཅིག་གཡུལ་སྤྲད་དོ།
en: Prince Kuśa asked the ministers, ‘Sirs, why did you shut the gates?’ When they had explained the details to him, Prince Kuśa said, ‘If the daughter of the king is given to me, I will fight him.’

source: །དེ་རྣམས་ཀྱིས་རྒྱལ་པོ་ལ་སྨྲས་པ་དང་། དེས་སྨྲས་པ།
en: “They reported this to the king.

source: བུ་མོ་འདི་ངས་ལ་ཉེ་ཅན་ཆེན་པོའི་བུ་ལ་བྱིན་ཟིན་ན་ངས་ཇི་ལྟར་འདི་ལ་སྦྱིན།
en: The king said, ‘I have already given this daughter to a son of King Mahāśakuni. How could I give her to this man?

source: ད་ལྟར་གྱི་ཁྲག་ཁྲུག་འདི་ཡང་བུ་མོ་ཁོ་ནའི་ཕྱིར་ཡིན་ནོ།
en: This present conflict itself has happened in relation to this daughter.’

source: །བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “ ‘Your Majesty,’ said the ministers, ‘we do not know which will win.

source: ལྷ་སུ་རྒྱལ་བར་འགྱུར་གཏོལ་མ་མཆིས་ཀྱིས་རེ་ཞིག་འདི་དེ་རྣམས་དང་ལྷན་ཅིག་གཡུལ་སྤྲོད་དུ་སྩོལ་ཅིག་དང་། དེ་ན་སྐོལ་གྱིས་དུས་མཁྱེན་པར་འགྱུར་རོ།
en: Let him fight them for the time being. Then we will arrange the matter suitably.’

source: །རྒྱལ་པོས་སྨྲས་པ། དེ་བཞིན་དུ་གྱིས་ཤིག །བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “ ‘You should do so,’ agreed the king.

source: སྟོང་ཐུབ་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱའོ།
en: “The ministers ordered him, ‘You, match for a thousand, do as you said.’

source: །དེ་ནས་གཞོན་ནུ་ཀུ་ཤས་མདའ་ལྔ་བརྒྱ་ཤོང་བའི་དོང་པ་གཉིས་ཐོགས་ནས་དུང་དང་། འཁོར་ལོ་དང་། བེ་ཅོན་ཁྱེར་ཏེ་བྱུང་ནས་དེས་དུང་བུས་པ་དང་། དེ་རྣམས་ཀྱི་རྣ་བ་རྡོལ་ནས་བྲོས་སོ།
en: “Prince Kuśa then departed, holding two quivers that contained five hundred arrows each, and carrying a conch shell, chakra, and club. When he had blown the conch shell, the enemy ran away, their eardrums broken.

source: །རྒྱལ་པོའི་བུ་མོ་དེས་བསམས་པ། གཞོན་ནུ་ཀུ་ཤ་འདི་ནི་བརྩོན་འགྲུས་དང་ཕ་རོལ་གནོན་པ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ན་ཅིའི་ཕྱིར་བདག་གིས་འདི་ལ་དགའ་བར་མི་བྱ་སྙམ་ནས། དེ་དེ་ལ་དགའ་བ་བསྐྱེད་ནས་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The princess thought, ‘Since this Prince Kuśa has great vigor and courage, why should I feel revulsion toward him?’ She felt pleased with him and said to the king, ‘Please do as you promised.’

source: །ཇི་སྐད་ཞལ་གྱིས་བཞེས་པ་དེ་མཛོད་ཅིག །བུ་ངས་ཁྱོད་ཀུ་ཤ་ལ་བྱིན་ནོ།
en: “ ‘My daughter, I have given you to Kuśa.’

source: །དེས་སྨྲས་པ། ཡབ་གཞོན་ནུ་ཀུ་ཤ་དེ་ནི་འདི་ཉིད་ལགས་སོ།
en: “ ‘Father,’ she said, ‘that Prince Kuśa is none other than this man.’

source: །བུ་གལ་ཏེ་དེ་ལྟ་ན་སོང་ཤིག་ཅེས་དེས་དེ་ལ་ཡན་ལག་བཞི་པའི་དཔུང་གི་ཚོགས་བྱིན་ནས་བཀུར་སྟི་ཆེར་བྱས་ཏེ་བཏང་ངོ་།
en: “ ‘My daughter, if so, go with him.’ “The king gave him an army consisting of four divisions. He also gave him his daughter, performing a great ceremony.

source: །དེ་རི་འོར་དེར་ཕྱིན་ནས་དེ་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་ཁོ་བོའི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པའི་ཕྱེད་བྱིན་ཅིག །དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “The prince returned to the hamlet and requested them, ‘Sirs, give me that half of an army consisting of four divisions.’

source: གཞོན་ནུ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་ཁྱེར་བའི་ཆུ་བྲུག་པ་གང་ཡིན་པ་དེ་ལྟ་བུ་བྱུང་ངོ་།
en: “ ‘O Prince,’ they replied, ‘there was such a flood that it carried away the four-division army.’

source: །དེ་ན་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ན་ལུག་དག་ཅིག་རྒྱུ་ནས་གཞོན་ནུ་ཀུ་ཤས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “There were sheep walking nearby. Prince Kuśa spoke a verse:

source: ལོ་ནི་དྲུག་བཅུ་ལོན་པའི་གླང་། །གླང་ཆེན་གང་དུ་ཁྱེར་གྱུར་པ།
en: “ ‘Where elephants, which are large animals living up to sixty years,

source: །དེར་ནི་བ་དང་ལུག་ཁྱེར་བར།
en: Were brought, Cows and sheep would have been brought, too.

source: །རྗེས་སུ་དཔགས་ནས་ཤེས་པར་བྱ།། །།འདུལ་བ་གཞི། བམ་པོ་བཞི་བཅུ་རྩ་གསུམ་པ།
en: Thus should one conjecture.

source: གལ་ཏེ་རེ་ཞིག་བྱིན་ན་ནི་དེ་ལྟ་ན་ལེགས།
en: “ ‘If you give it to me, that’s fine.

source: གལ་ཏེ་མ་བྱིན་ན་རྔམས་ལ་གཏུག་གོ།
en: But if you do not, I will destroy you.’

source: །དེ་རྣམས་ཀྱིས་དེ་ལ་བྱིན་ནས་དེ་འབབ་ཆུ་དང་ཉེ་བ་ཞིག་ཏུ་བཏབ་སྟེ།
en: They gave him the army. “He stayed near a river, and when he had leisure time, he entered the river to bathe.

source: དལ་བས་ཁྲུས་བྱ་བའི་ཕྱིར་ཞུགས་པ་དང་། དེ་ན་དེས་རང་གི་བཞིན་གྱི་གཟུགས་བརྙན་མཐོང་ནས་དེས་བསམས་པ། མཚན་ངན་པ་བཅྭ་བརྒྱད་དང་ལྡན་ཞིང་བཞིན་སེང་གེའི་གདོང་དང་འདྲ་བ་ཡིན་ཏེ།
en: He saw the image of his face there and thought, ‘I have eighteen inauspicious marks and a face like a lion.

source: དེ་ཉིད་ཀྱི་ཕྱིར་རྒྱལ་པོའི་བུ་མོ་འདི་བདག་ལ་མི་དགའ་བ་ཡིན་གྱིས།
en: This is why the princess felt revulsion toward me.

source: བདག་འདྲ་བ་ནི་གསོན་ན་ཅི་རུང་སོང་ལ་བདག་འཆིའོ་སྙམ་ནས།
en: What use is the life of such a man like me? I will go and kill myself.’

source: དེ་ནགས་ཐིབས་པོ་ཞིག་ཏུ་ཞུགས་ནས་བདག་ཉིད་འགག་པར་བརྩམས་པ་དང་། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ།
en: “He went to a certain dense forest and tried to hang himself.

source: འདི་ནི་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་ཡིན་ན། གཟུགས་བཟང་པོ་དང་མི་ལྡན་པས་བདག་ཉིད་གསོད་པར་བྱེད་ཀྱིས།
en: Śakra, Lord of the Gods, thought, ‘Although he is the bodhisattva of the fortunate eon, he will kill himself because of a lack of beauty.

source: དེའི་ཡིད་ལ་རེ་བ་རྫོགས་པར་བྱའོ་སྙམ་ནས་བརྒྱ་བྱིན་གྱིས།
en: I must fulfill his wish.’

source: སྨྲས་པ། གཞོན་ནུ་ཡི་མ་ཆད།
en: “Śakra said, ‘O Prince, do not be depressed.

source: བདག་ཉིད་གསོད་པར་མ་བྱེད་པར་གཙུག་གི་ནོར་བུ་འདི་མགོ་ལ་ཐོགས་ཤིག་དང་ཡིད་ལ་རེ་བ་རྫོགས་པར་འགྱུར་རོ་ཞེས་སྨྲས་ནས་སོང་ངོ་།
en: Do not kill yourself. Wear this crest jewel on your head, and your wish will be fulfilled.’ Then he departed.

source: །གཞོན་ནུ་ཀུ་ཤ་ཁྱིམ་དུ་འཇུག་པར་བརྩམས་པ་དང་། སྒོ་སྲུངས་ཀྱི་མིས་འདི་ནི་གཞོན་ནུ་ཀུ་ཤའི་ཕོ་བྲང་ཡིན་གྱིས་མ་འཇུག་ཤིག་ཅེས་བཟློག་གོ།
en: “When Prince Kuśa tried to enter his residence, a guard stopped him, saying, ‘This is the palace of Prince Kuśa. You cannot enter.’

source: །དེས་སྨྲས་པ། ཀུ་ཤ་དེ་ནི་ང་ཡིན་ནོ།
en: “ ‘That Kuśa is me,’ he replied.

source: །དེ་ནི་ཡིད་མ་ཆེས་ནས་དེས་གཙུག་གི་ནོར་བུ་ཕྲོལ་བ་དང་། སྔོན་གྱི་ཇི་ལྟ་བ་བཞིན་དུ་གྱུར་ནས་དེ་ཡིད་ཆེས་སོ།
en: “The guard did not believe him. The prince took the crest jewel off and he looked as before, so then the guard believed him.

source: །གཞོན་ནུ་ཀུ་ཤས་བསམས་པ།
en: Prince Kuśa thought that he would stay there.

source: འདི་ཉིད་དུ་འདུག་གོ་སྙམ་ནས་དེས་ཕ་ལ་ཡང་མཁྱེན་པར་མཛོད་ཅིག །འདི་ཉིད་དུ་མཆིས་སོ་ཞེས་སྤྲིང་བ་དང་། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དེ་ལ་གཏེར་བཞིའི་འབྱུང་ཁུང་བསྟན་ནས།
en: He then sent a message to his father: ‘Please be informed that I am here.’ “Śakra, Lord of the Gods, told him about mines of four kinds of treasure.

source: དེས་གྲོང་ཁྱེར་དེ་རིན་པོ་ཆེ་སྣ་བཞི་ལས་བྱེད་དུ་བཅུག་གོ།
en: He had the city built with four kinds of precious materials.

source: །གཞོན་ནུ་ཀུ་ཤ་གནས་པས་ཀུ་ཤ་ཅན་ཞེས་བྱ་བར་གྲགས་སོ།
en: Since Prince Kuśa lived there, the city was named Kuśāvatī.

source: །དེ་ནི་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཀུ་ཤ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: He became a wheel-turning king of power named Kuśa.

source: དེས་གྲོང་ཁྱེར་དྲུག་ཁྲིར་མཆོད་སྦྱིན་གྱི་གནས་བརྩིགས་ཏེ།
en: He built places for offerings in sixty thousand cities.

source: ལོ་མང་པོ་དང་ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པ་བཏང་སྟེ།
en: He gave donations to brahmins for years—hundreds of years, thousands of years, hundreds of thousands of years.

source: དེ་བདག་ཉིད་ཀྱི་མཆོད་སྦྱིན་ཕུན་སུམ་ཚོགས་པ་མཐོང་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Seeing the perfection of his offerings, he spoke these verses:

source: ལྷ་དང་མི་ཡི་ནང་དག་ཏུ།
en: “ ‘Among gods and humans,

source: །བདག་གི་འབྱོར་པ་མཐོང་ནས་ནི། །གང་གིས་ཕུན་སུམ་འཐོབ་པ་ཡི།
en: Seeing his own wealth,

source: །སྦྱིན་པ་སུ་ཞིག་སྦྱིན་མི་བྱེད།
en: Who will not give donations From which he will attain success?

source: །གང་གིས་སྐྱེས་བུ་བརྒྱ་ཕྲག་ཐིབས་མནན་ཅིང་།
en: “ ‘Having conquered hundreds of humans

source: །སེར་སྣ་དགྲ་བོར་གྱུར་པ་ཟིལ་མནན་ནས།
en: And defeated the enemy, avarice,

source: །འཇིག་རྟེན་ཕ་རོལ་འཇིགས་པས་སྦྱིན་གཏོང་སྟེ།
en: One who fears the next life gives donations

source: །བདག་ནི་དཔའ་བོའི་དཔའ་རབ་ཡིན་པར་སེམས།
en: And regards himself as the hero of heroes.

source: །གང་ཞིག་ལག་ན་མཚོན་ཐོགས་གཡུལ་ངོར་འཇུག །དེ་ནི་དཔའ་བོ་མིན་ཞེས་ཐུབ་རྣམས་གསུང་།
en: “ ‘Those who go into battle with weapons in their hands Are not heroes, say the munis.

source: །གང་དག་འཇིགས་པ་མེད་པར་སྦྱིན་གཏོང་བ།
en: Those who give donations without fear

source: །དེ་དག་དཔའ་བོ་ཡིན་ཞེས་ཀུན་མཁྱེན་གསུང་།
en: Are heroes, says the Omniscient One.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཀུ་ཤ་ཞེས་བྱ་བར་གྱུར་པ་གང་གིས་གྲོང་ཁྱེར་དྲུག་ཁྲིར་སྦྱིན་པ་དག་བཏང་། བསོད་ནམས་དག་བྱས་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was that wheel-turning king of power named Kuśa and gave donations and made merit in the sixty thousand cities at that time, on that occasion, was someone else, you should think otherwise.

source: འོན་ཀྱང་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཀུ་ཤ་ཞེས་བྱ་བ་དེར་གྱུར་ཏེ། ངས་དེ་ན་གྲོང་ཁྱེར་དྲུག་ཁྲིར་མཆོད་སྦྱིན་གྱི་གནས་བརྩིགས་ནས་སྦྱིན་པ་དག་བཏང་། བསོད་ནམས་དག་བྱས་སོ།
en: I was the wheel-turning king of power named Kuśa at that time, on that occasion, and there I built places for offerings in sixty thousand cities, gave donations, and made merit.

source: །རྒྱལ་པོ་ཆེན་པོ་ངའི་སྦྱིན་པའམ་སྦྱིན་པའི་བགོ་བཤའ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཏོ་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening by those donations or distributions of donations, you should think otherwise;

source: འོན་ཀྱང་ངའི་སྦྱིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་། རྐྱེན་ཙམ་དང་། ཚོགས་ཙམ་ཡིན་ནོ།
en: those donations of mine were only a cause, only a condition, only a preparation for supreme and complete awakening.” b. The Former Life of Prince Kuśa

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་རྒྱལ་པོ་ཀུ་ཤས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས། མཚན་མི་སྡུག་པ་རྣམ་པ་བཅྭ་བརྒྱད་དང་ལྡན་ཞིང་ཕྱུག་པ་ནོར་མང་བ། ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་པ་ལགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, what karma did Kuśa create that matured to cause him to have eighteen inauspicious marks and to be born to a family that was rich and had great wealth and many possessions?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཀུ་ཤ་ཉིད་ཀྱིས་ལས་ཚོགས་རྙེད་པ་རྐྱེན་ཡོངས་སུ་བསྒྱུར་བ།
en: “Monks,” the Blessed One replied, “the actions were performed and accumulated by Kuśa himself, accruing a heap of karma.

source: གདོན་མི་ཟ་བར་འབྱུང་བར་འགྱུར་བ་དག་བྱས་ཤིང་བསགས་པས་དགེ་སློང་དག་ཀུ་ཤ་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་པ་དག་གཞན་སུ་ཞིག་གིས་སོ་སོར་མྱོང་བར་འགྱུར།
en: Who else but Kuśa would experience the actions that he himself performed and accumulated?

source: འདི་ལྟར་ལས་དགེ་བ་དང་། མི་དགེ་བ་བྱས་ཤིང་བསགས་པ་དག་ནི་ཟིན་པའི་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་ལ་རྣམ་པར་སྨིན་པར་འགྱུར་ཏེ།
en: Virtuous and nonvirtuous actions performed and accumulated like this mature in the aggregates, elements, and sense spheres.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་རི་འོར་གཞན་ཞིག་ན་ཁྱིམ་བདག་ཅིག་གནས་ཏེ།
en: “Monks, once there lived a householder in a hamlet.

source: དེས་བཟའ་བ་དང་། བཅའ་བ་རབ་ཏུ་མང་པོ་ཁྱེར་ཏེ་སྐྱེད་མོས་ཚལ་དུ་སོང་ངོ་།
en: He went to a park, taking various kinds of plentiful food with him.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འབྱུང་བ་མེད་པ་ན་འཇིག་རྟེན་དུ་རང་སངས་རྒྱས་དམན་པ་དང་ངན་པ་ལ་སྙིང་བརྩེ་བ་ཅན། བས་མཐའི་གནས་མལ་ལ་དགའ་བ། འཇིག་རྟེན་གྱི་ཡོན་གནས་གཅིག་པུ་དག་འབྱུང་བར་འགྱུར་རོ།
en: “When the buddhas do not appear, there appear self-awakened ones as the only ones worthy of veneration in the world, who are compassionate toward inferior, wretched people and content with places to sit on the outskirts of towns.

source: །དེ་ནས་རང་སངས་རྒྱས་ཤིག་ལྗོངས་རྒྱུ་ཞིང་སོང་བ་ན་སྐྱེད་མོས་ཚལ་དེར་ཕྱིན་པ་ཁྱིམ་བདག་དེས་མཐོང་ནས་དེས་ཞོ་ཤས་འཚོ་བ་རྣམས་ལ་བསྒོ་བ།
en: “At that time, a certain wandering self-awakened one arrived at the park. When he saw him, the householder ordered his laborers, ‘Sirs, drive this mendicant away.’

source: ཤེས་ལྡན་དག་རབ་ཏུ་བྱུང་བ་འདི་སྐྲོད་ཅིག །དེ་དག་སྐྲོད་མ་ཕོད་པ་དང་། །ཁྱིམ་བདག་དེ་ཉིད་ལངས་ཏེ་བཟུང་ནས་བསྐྲད་དེ།
en: “They were not able to drive him away.

source: སེང་གེའི་གདོང་ཅན་མཚན་ངན་པ་བཅྭ་བརྒྱད་དང་ལྡན་པ་ཁྱོད་གར་འགྲོ་ཞེས་ཀྱང་སྨྲས་སོ། །རང་སངས་རྒྱས་དེས་བསམས་པ།
en: The householder stood up, caught the self-awakened one by himself, and drove him away, saying, ‘Where are you going, you who have a face like a lion and eighteen inauspicious marks?’

source: ཉོན་མོངས་འདི་གཏན་དུ་སྨས་ཤིང་ཉམས་ན་མི་རུང་ངོ་སྙམ་དུ་རིག་ནས་སྟེང་གི་ནམ་མཁའ་ལ་ཞེས་བྱ་བ་ནས། དེས་བཀུར་སྟི་བྱས་ཏེ་ཞེས་བྱ་བའི་བར་དུ་རྒྱས་པར་སྦྱར་ཏེ། ཇི་ཙམ་ན་རྐང་པ་གཉིས་ལ་གཏུགས་ནས་སྨོན་ལམ་བཏབ་པ།
en: “The self-awakened one thought, ‘Alas, it is not right if this man is always hurt and injured.’ He soared high into the sky . . . . The householder served him, and then threw himself at the feet of the self-awakened one and made an aspiration:

source: བདག་གིས་ཡོན་གནས་དམ་པ་འདི་ལྟ་བུ་ལ་ངག་རྩུབ་པོའི་ལས་ཕྱུང་བ་གང་ཡིན་པ་དེའི་ལས་དེ་བདག་གིས་མྱོང་བར་མ་གྱུར་ཅིག །གང་ཡང་བྱ་བ་བྱས་པའི་དགེ་བའི་རྩ་བ་འདིས་བདག་ཕྱུག་ཅིང་ནོར་མང་བ་དང་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: ‘May I not receive the karma I created of harsh speech toward such an excellent one worthy of veneration. May I be born to a family that is rich and has great wealth and many possessions, through this root of merit from performing service for him.’

source: ཁྱིམ་བདག་གང་ཡིན་པ་དེ་ཀུ་ཤ་གཞོན་ནུ་འདི་ཉིད་ཡིན་ཏེ།
en: That householder was indeed this Prince Kuśa.

source: དེ་ན་འདིས་རང་སངས་རྒྱས་ལ་ངག་རྩུབ་པོའི་ལས་ཕྱུང་བས་ལས་དེའི་རྣམ་པར་སྨིན་པས་མཚན་ངན་པ་བཅྭ་བརྒྱད་དང་ལྡན་ཞིང་བཞིན་སེང་གེའི་གདོང་འདྲ་བར་གྱུར་ཏོ།
en: Because of the maturation of the karma he created of harsh speech toward the self-awakened one there, he became one who had eighteen inauspicious marks and a face like a lion.

source: །གང་ཡང་བྱ་བ་བྱས་པ་དེའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཏོ།
en: And because of the maturation of the karma of performing service for him, he became a wheel-turning king of power.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པར་འགྱུར་ཞིང་འདྲེན་མ་རྣམས་ཀྱི་ནི་འདྲེན་མར་འགྱུར།
en: “Therefore, monks, the maturation of entirely negative actions is entirely negative;

source: གཅིག་ཏུ་དཀར་བ་རྣམས་ནི་གཅིག་ཏུ་དཀར་བར་འགྱུར་རོ།
en: the maturation of entirely positive actions is entirely positive; the maturation of those that are mixed is mixed.

source: །དེ་ལྟ་བས་ན་དགེ་སློང་དག་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ། ལས་གང་དག་གཅིག་ཏུ་གནག་པ་རྣམས་དང་འདྲེན་མ་རྣམས་ནི་སྤངས་ལ།
en: Therefore, monks, henceforth you should abandon entirely negative and mixed actions, and you should seek entirely positive actions.

source: གཅིག་ཏུ་དཀར་བའི་ལས་རྣམས་ཁོ་ན་ལ་བརྩལ་བར་བྱའོ་ཞེས་དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: Monks, that is how you must train.” 5.

source: །གཞན་ཡང་རྒྱལ་པོ་ཆེན་པོ་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་སྦྱིན་པ་དག་བཏང་བསོད་ནམས་དག་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་ཡུལ་ཀ་ལིང་ཀ་ཞེས་བྱ་བར་གདོལ་པའི་རྒྱལ་པོ་ཕུར་བུ་གསུམ་པ་ཞེས་བྱ་བ་འཁོར་གདོལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། འཁོར་གདོལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། གདོལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཡོད་པ།
en: Triśaṅku “Great King, again, seeking supreme and complete awakening, I gave donations and made merit. Listen to that story.

source: བྱམས་པའི་བདག་ཉིད་སྙིང་རྗེ་ཅན། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་སྙིང་བརྩེ་བ་ཞིག་བྱུང་སྟེ།
en: “Great King, once there was a mātaṅga king named Triśaṅku in a country called Kaliṅga, who had hundreds and thousands—hundreds of thousands—of mātaṅga attendants, was naturally loving and merciful, benefited all beings, and had compassion for them.

source: དེའི་ཡུལ་དུ་ནམ་ལོ་ཉེས་བྱུང་བ་དེའི་ཚེ་བདེན་པ་གསོལ་བས་ལྷས་ཆར་པ་འབེབས་པས་ལན་འགའ་ཡང་ལོ་ཉེས་འབྱུང་བར་མི་འགྱུར་རོ།
en: Whenever a famine broke out in his country, the gods brought rain in answer to his appeal to the truth, so that there was never a serious famine.

source: །དེ་དྲང་སྲོང་གི་ནང་དུ་རབ་ཏུ་བྱུང་ནས་དེས་མངོན་པར་ཤེས་པ་ལྔ་མངོན་སུམ་དུ་བྱས་སོ།
en: He went forth among ṛṣis and realized the five kinds of supernormal knowledge.

source: །དེའི་ཚེ་ཡུལ་བཱ་རཱ་ཎ་སཱི་ན་རྒྱལ་པོ་ཚངས་སྦྱིན་ཞེས་བྱ་བ་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་། མི་ཕལ་པོ་ཆེས་རབ་ཏུ་གང་བ་ན་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ།
en: “ At that time in Vārāṇasī, a king named Brahmadatta was ruling over the country, which was rich, prosperous, peaceful, abundant in food, and full of many people.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་ལྟས་མཁན་རྣམས་ཀྱིས་ལོ་བཅུ་གཉིས་སུ་ཆར་མི་འབབ་བོ་ཞེས་ལུང་བསྟན་ཏོ།
en: One day astrologers predicted that it would not rain for twelve years.

source: །དེ་ནས་རྒྱལ་པོ་ཚངས་སྦྱིན་གྱིས་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱིར་དྲིལ་སྒྲོག་ཏུ་བཅུག་པ།
en: King Brahmadatta then announced with the ringing of bells in the city of Vārāṇasī:

source: བཱ་རཱ་ཎ་སཱི་ན་གནས་པའི་ཤེས་ལྡན་གྲོང་ཁྱེར་པ་དག་ཉོན་ཅིག །ལྟས་མཁན་རྣམས་ཀྱིས་ལོ་བཅུ་གཉིས་སུ་ཆར་མི་འབབ་བོ་ཞེས་ལུང་བསྟན་གྱིས།
en: ‘Listen, sirs, citizens living in Vārāṇasī! Astrologers have predicted that it will not rain for twelve years.

source: ཁྱེད་ཅག་ལས་གང་དག་ལ་དུས་དེ་ཙམ་གྱི་བཟའ་བ་ཡོད་པ་དེ་ནི་འདུག་ཤིག །གང་དག་མེད་པ་དེ་ནི་དེང་ཤིག །དེ་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་དག་མུ་གེས་དུས་མ་ཡིན་པར་འཆི་བས་འཇིགས་སྐྲག་ནས་གྲོས་བྱ་བར་བརྩམས་པ།
en: Whoever among you has food for the duration should stay. Those who do not should leave.’ “Then many people began to discuss this with each other for fear of an untimely death from the famine:

source: ཤེས་ལྡན་དག་རྒྱལ་པོས་ཡུལ་རྣམས་སུ་འདི་ལྟ་བུའི་དྲིལ་སྒྲོག་ཏུ་བཅུག་ན་དེ་ཇི་ལྟར་བསྒྲུབ་པར་བྱ།
en: ‘Sirs, such-and-such a matter has been announced by the king who rules over the regions.

source: གང་དུ་དོང་།
en: What should we do about this?

source: དེ་རྣམས་ཀྱིས་གདོལ་པའི་ཡུལ་ན་གདོལ་པའི་རིགས་ལས་བྱུང་བའི་དྲང་སྲོང་ཞིག་ཡོད་དེ།
en: Where should we go?’ They heard that there was a ṛṣi from a mātaṅga family in the country of the mātaṅgas, and gods brought rain in answer to his appeal to the truth.

source: དེའི་བདེན་པ་གསོལ་བས་ལྷས་ཆར་འབེབས་སོ་ཞེས་ཐོས་ནས་དེ་ནས་ལོ་བཅུ་གཉིས་ཀྱི་བར་གྱི་བཟའ་བ་མེད་པ་གང་ཡིན་པ་དེ་རྣམས་གདོལ་པའི་ཡུལ་དུ་དོང་བ་དང་། གདོལ་པའི་རིགས་ལས་བྱུང་བའི་དྲང་སྲོང་གི་བུ་གདོལ་པའི་རྒྱལ་པོ་དེས་སྐྱེ་བོའི་ཚོགས་དེའི་བཟའ་བ་དང་བཏུང་བ་ལོ་བཅུ་གཉིས་སུ་སྦྱར་ན་མུ་གེ་རྒྱུན་ཆགས་ཁོ་ནར་བྱུང་བ་ནས་རྒྱལ་པོ་ཚངས་སྦྱིན་གྱིས་བློན་པོ་རྣམས་ལ་དྲིས་པ།
en: Those who did not have food for twelve years went to the country of the mātaṅgas. The king of the mātaṅgas, the son of a ṛṣi from a mātaṅga family, provided the people with food and drink for twelve years.

source: སྐྱེ་བོའི་ཚོགས་དེ་གང་དུ་དོང་།
en: The famine persisted, and King Brahmadatta asked his ministers, ‘Where did those people go?’

source: བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་ཡུལ་ཀ་ལིང་ཀ་ན་གདོལ་པའི་རྒྱལ་པོ་ཕུར་བུ་གསུམ་པ་ཞེས་བགྱི་བ་བྱམས་པའི་བདག་ཉིད་སྙིང་རྗེ་ཅན་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ། འོ་བྱམས་པ་ཞིག་མཆིས་ཏེ།
en: “ ‘Your Majesty,’ answered the ministers, ‘there is a mātaṅga king named Triśaṅku in the country of Kaliṅga, who is naturally loving and merciful, benefits all beings, and has compassion for them.

source: དེའི་བདེན་པ་གསོལ་བས་ལྷས་ཆར་འབེབས་པས་དེར་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་མཆིས་སོ། །རྒྱལ་པོས་སྨྲས་པ།
en: Gods bring rain in answer to his appeal to the truth, and so many people went there.’

source: ཤེས་ལྡན་དག་མུ་གེ་ཆེན་པོ་འདི་ནི་མུ་གེའི་བསྐལ་པ་བར་མ་དང་འདྲ་བ་ཡིན་ན་དེ་ལ་ཇི་ལྟར་བསྒྲུབ་པར་བྱ།
en: “ ‘Sirs, this great famine seems to be an interval between even greater famines.

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: What should we do about this?’ asked the king.

source: ལྷ་གདོལ་པའི་ཡུལ་གྱི་རྒྱལ་པོ་གང་ལགས་པ་དེ་དྲང་སྲོང་གི་ནང་དུ་རབ་ཏུ་བྱུང་ངོ་ཞེས་ཐོས་ལགས་ཀྱིས།
en: “ ‘Your Majesty,’ they replied, ‘we have heard that this king of the country of the mātaṅgas went forth among ṛṣis.

source: དེ་ལ་གསོལ་བ་མཛོད་ཅིག །དེ་ནས་རྒྱལ་པོ་ཚངས་སྦྱིན་གདོལ་པའི་ཡུལ་དུ་སོང་ནས་དྲང་སྲོང་དེ་ལ་གསོལ་བ་གདབ་པར་བརྩམས་པ།
en: Please request help from him.’ “Then King Brahmadatta went to the country of the mātaṅgas and requested help from the ṛṣi:

source: དྲང་སྲོང་ཆེན་པོ་བདག་གི་ཡུལ་དུ་མུ་གེ་ཆེན་པོ་མུ་གེའི་བསྐལ་པ་བར་མ་དང་འདྲ་བ་བྱུང་ན་དེ་ལ་བདེན་པ་གསོལ་བའི་རིགས་སོ།
en: ‘O great ṛṣi, a great famine, which seems to be an interval between even greater famines, has broken out in my country. It would be appropriate if you could make an appeal to the truth about this.’

source: །དེས་བདེན་པ་གསོལ་བར་བརྩམས་པ།
en: “The ṛṣi then made an appeal to the truth: “ ‘I, a mātaṅga named Triśaṅku,

source: ཁྱི་འཚེད་རིགས་ལས་སྐྱེས་པ་ཡི།
en: Who was born to the lineage of Śvapāka,

source: །ཞེ་སྡང་མེད་ཅིང་འཚེ་མེད་པ། །གདོལ་པ་ཕུར་བུ་གསུམ་པ་ཞེས།
en: Am free from wrath and free from enemies,

source: །ལྷ་དང་མི་ལ་གྲགས་པ་ཡིས།
en: And am well known to gods and humans— “ ‘By my true words,

source: །སེམས་ཅན་ཀུན་ལ་བྱམས་པའི་སེམས། །སྐྱོན་མེད་རབ་ཏུ་བསྒོམས་བདག་གི།
en: I who have well cultivated faultless thoughts of love Toward all beings, May nāgas satisfy these people.

source: །བདེན་ཚིག་དེས་ནི་སྐྱེ་དགུ་འདི།
en: “ ‘In answer to my true words,

source: །ཀླུས་ནི་ཚིམ་པར་བྱེད་གྱུར་ཅིག །གང་ཕྱིར་སྐྱེས་པ་ཚུན་ཆད་ནས།
en: For the purpose of which

source: །བྱམས་པའི་སེམས་ནི་རབ་བསྒོམས་པ།
en: I have, from birth, well practiced love,

source: །བདེན་པའི་ཚིག་དེས་སྐྱེ་དགུ་དག །ཀླུས་ནི་ཚིམ་པར་བྱེད་གྱུར་ཅིག །དེ་ནས་བདེན་པ་གསོལ་བས་ཡུལ་བཱ་རཱ་ཎ་སཱིར་ལྷས་ཆར་ཕབ་ནས་མུ་གེ་རྒྱུན་ཆད་ཅིང་ལོ་ལེགས་པར་གྱུར་ཏོ།
en: May nāgas satisfy these people.’ “In answer to this appeal to the truth, the gods brought rain to Vārāṇasī. The famine ended, and there was a bumper crop.

source: །དེ་ནས་བཱ་རཱ་ཎ་སཱི་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་དེ་གདོལ་པའི་ཡུལ་ནས་བཱ་རཱ་ཎ་སཱིར་ལྷགས་སོ།
en: After that, the inhabitants of Vārāṇasī came back from the country of mātaṅgas to Vārāṇasī.

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་གདོལ་པའི་རྒྱལ་པོ་ཕུར་བུ་གསུམ་པ་ཞེས་བྱ་བ་བྱམས་པའི་བདག་ཉིད་སྙིང་རྗེ་ཅན། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ། སྙིང་བརྩེ་བ་ཅན་ཞིག་བྱུང་བ་དེའི་བདེན་པ་གསོལ་བས་ལྷས་ཆར་ཕབ་ནས་མུ་གེ་རྒྱུན་ཆད་ཅིང་ལོ་ལེགས་པར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was that mātaṅga king named Triśaṅku, naturally loving and merciful, who benefited all beings and had compassion for them, and in answer to whose appeal to the truth the gods brought rain so that the famine ended and there was a bumper crop at that time, on that occasion, was someone else, you should think otherwise.

source: འོན་ཀྱང་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་གདོལ་པའི་རྒྱལ་པོ་ཕུར་བུ་གསུམ་པ་ཞེས་བྱ་བ་བྱམས་པའི་བདག་ཉིད་སྙིང་རྗེ་ཅན། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། སྙིང་བརྩེ་བ་ཅན་དེའི་བདེན་པ་གསོལ་བས་ལྷས་ཆར་འབེབས་པ་དེ་ཡིན་པར་གྱུར་ཏོ།
en: I was the mātaṅga king named Triśaṅku, who was naturally loving and merciful, who benefited all beings and had compassion for them, and in answer to whose appeal to the truth the gods brought rain so that the famine ended and there was a bumper crop at that time, on that occasion.
